of_seminar_Sloshing/sloshingTank_G/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    side
    {
        type            movingWallVelocity;
	value		uniform (0 0 0);
    }
    top
    {
        type            movingWallVelocity;
	value		uniform (0 0 0);
    }
    bottom
    {
         type            movingWallVelocity;
	value		uniform (0 0 0);
    }
    
}


// ************************************************************************* //
