of_seminar_Sloshing/sloshingTank_G/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2016 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General macros to create cylinder mesh











// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

// Inner square side half


// Inner square side curvature


// cylinder radius


// Height of cylinder


// Base z


// Outlet z


// Number of cells at inner square


// Number of cells between inner square and circle


// Number of cells in the cylinder height


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




// 45 degree points angle





// Half of 45 degree points angle

























// Inner square x and y position

// x





// y





// Circle x and y positions

// x





// y





// Inner square x and y position middle curvatures

// x





// y





// Circle x and y positions middle curvatures

// x





// y





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (150 -150 0) // Vertex s0b = 0 
    (-150 -150 0) // Vertex s1b = 1 
    (-150 150 0) // Vertex s2b = 2 
    (150 150 0) // Vertex s3b = 3 
    
    (212.132034355964 -212.132034355964 0) // Vertex r0b = 4 
    (-212.132034355964 -212.132034355964 0) // Vertex r1b = 5 
    (-212.132034355964 212.132034355964 0) // Vertex r2b = 6 
    (212.132034355964 212.132034355964 0) // Vertex r3b = 7 
    
    (150 -150 960) // Vertex s0t = 8 
    (-150 -150 960) // Vertex s1t = 9 
    (-150 150 960) // Vertex s2t = 10 
    (150 150 960) // Vertex s3t = 11 
    
    (212.132034355964 -212.132034355964 960) // Vertex r0t = 12 
    (-212.132034355964 -212.132034355964 960) // Vertex r1t = 13 
    (-212.132034355964 212.132034355964 960) // Vertex r2t = 14 
    (212.132034355964 212.132034355964 960) // Vertex r3t = 15 
);

blocks
(
    //block0
    hex (1 0 3 2 9 8 11 10)
    square
    (10 10 50)
    simpleGrading (1 1 1)
    
    //block1
    hex (0 4 7 3 8 12 15 11)
    innerCircle
    (5 10 50)
    simpleGrading (1 1 1)
    
    //block2
    hex (3 7 6 2 11 15 14 10)
    innerCircle
    (5 10 50)
    simpleGrading (1 1 1)
    
    //block3
    hex (2 6 5 1 10 14 13 9)
    innerCircle
    (5 10 50)
    simpleGrading (1 1 1)
    
    //block4
    hex (1 5 4 0 9 13 12 8)
    innerCircle
    (5 10 50)
    simpleGrading (1 1 1)
);

edges
(
    //Circle edges
    arc 7 4 (300 0 0)
    arc 4 5 (1.83697019872103e-14 -300 0)
    arc 5 6 (-300 3.67394039744205e-14 0)
    arc 6 7 (1.83697019872103e-14 300 0)
    
    //Circle edges
    arc 15 12 (300 0 960)
    arc 12 13 (1.83697019872103e-14 -300 960)
    arc 13 14 (-300 3.67394039744205e-14 960)
    arc 14 15 (1.83697019872103e-14 300 960)
    
    arc 3 0 (180 0 0)
    arc 0 1 (0 -180 0)
    arc 1 2 (-180 0 0)
    arc 2 3 (0 180 0)
    
    arc 11 8 (180 0 960)
    arc 8 9 (0 -180 960)
    arc 9 10 (-180 0 960)
    arc 10 11 (0 180 960)
    
);

patches
(
    wall side
    (
        (4 7 15 12)
        (5 4 12 13)
        (6 5 13 14)
        (7 6 14 15)
    )
    
    wall top
    (
        (3 0 1 2)
        (3 7 4 0)
        (2 6 7 3)
        (1 5 6 2)
        (0 4 5 1)
    )
    
    wall bottom
    (
        (11 10 9 8)
        (11 8 12 15)
        (10 11 15 14)
        (9 10 14 13)
        (8 9 13 12)
    )
);

mergePatchPairs
(
);

