of_seminar_Sloshing/sloshingTank_G/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.6;
maxAlphaCo      1;

maxDeltaT       1;


functions
{



	Probe1
	{
		type		probes;
		libs		("libsampling.so");

		writeControl	runTime;
		writeInterval	0.01;
		fields		(alpha.water);

		probeLocations
		(
			(	0.001	0.24425	0.35	)
			(	0.001	0.24425	0.355	)
			(	0.001	0.24425	0.36	)
			(	0.001	0.24425	0.365	)
			(	0.001	0.24425	0.37	)
			(	0.001	0.24425	0.375	)
			(	0.001	0.24425	0.38	)
			(	0.001	0.24425	0.385	)
			(	0.001	0.24425	0.39	)
			(	0.001	0.24425	0.395	)
			(	0.001	0.24425	0.4	)
			(	0.001	0.24425	0.405	)
			(	0.001	0.24425	0.41	)
			(	0.001	0.24425	0.415	)
			(	0.001	0.24425	0.42	)
			(	0.001	0.24425	0.425	)
			(	0.001	0.24425	0.43	)
			(	0.001	0.24425	0.435	)
			(	0.001	0.24425	0.44	)
			(	0.001	0.24425	0.445	)
			(	0.001	0.24425	0.45	)
			(	0.001	0.24425	0.455	)
			(	0.001	0.24425	0.46	)
			(	0.001	0.24425	0.465	)
			(	0.001	0.24425	0.47	)
			(	0.001	0.24425	0.475	)
			(	0.001	0.24425	0.48	)
			(	0.001	0.24425	0.485	)
			(	0.001	0.24425	0.49	)
			(	0.001	0.24425	0.495	)
			(	0.001	0.24425	0.5	)
			(	0.001	0.24425	0.505	)
			(	0.001	0.24425	0.51	)
			(	0.001	0.24425	0.515	)
			(	0.001	0.24425	0.52	)
			(	0.001	0.24425	0.525	)
			(	0.001	0.24425	0.53	)
			(	0.001	0.24425	0.535	)
			(	0.001	0.24425	0.54	)
			(	0.001	0.24425	0.545	)
			(	0.001	0.24425	0.55	)

	);
	}



	
}

// ************************************************************************* //
