of_seminar_Sloshing/sloshingTank_G/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
actions
(
{										
	name	refineSet;								
	type	cellSet;								
	action	new;								
	source	boxToCell;								
	sourceInfo									
	{									
		box		(-5 -5 0.350)	(5 5 0.550); //Insert here coordinate of box that includes cells to refine
	}									
}	

);
